update creature_template set AIName = 'SmartAI' where entry in (101679, 95772, 95771, 95769, 95779, 99356, 99360, 99354, 101857, 99363, 101991, 99365, 100527, 99366, 100526);

delete from creature_template_addon where auras in (195110);

replace INTO `creature_template_addon` (`entry`, `path_id`, `mount`, `bytes1`, `bytes2`, `emote`, `auras`) VALUES ('99360', '0', '0', '0', '1', '0', '200760');
UPDATE `creature_template_wdb` SET `DisplayId3`='0', `DisplayId4`='0',  `DisplayId2`='0' WHERE (`Entry`='95779');
UPDATE `creature_template` SET `faction`='16',  `minlevel`='110', `maxlevel`='110' WHERE (`entry`='99363');
UPDATE `creature_template` SET `Mana_mod_extra`='120' WHERE (`entry`='100527');
update creature_template set ScriptName = 'boss_shade_of_xavius' where entry in (99192);


delete from smart_scripts where entryorguid in (101679, 95772, 95771, 95769, 95779, 99356, 99360, 99354, 101857, 99363, 101991, 99365, 100527, 99366, 100526);
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
(95771, 0, 0, 0, 1, 0, 100, 0, 6000, 12000, 7000, 12000, 11, 200448, 0, 0, 0, 0, 0, 19, 95772, 0, 0, 0, 0, 0, 0, "DH - ICC - visual"),
(95771, 0, 1, 0, 0, 0, 100, 0, 3000, 5000, 3000, 5000, 11, 200642, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 3-5 - cast"),
(95771, 0, 2, 0, 0, 0, 100, 0, 28000, 29000, 28000, 29000, 11, 200658, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 28-29 - cast"),
(95771, 0, 3, 0, 0, 0, 100, 0, 1000, 2000, 1000, 2000, 11, 204383, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, "DH - ever 1-2 - random cast"),

(99354, 0, 0, 0, 0, 0, 100, 1, 1, 1, 13000, 14000, 28, 165950, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "DH - pull - unaura"),
(99354, 0, 1, 0, 2, 0, 100, 0, 0, 95, 25000, 25000, 11, 201066, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "DH - 0-95% ever 25- cast"),
(99354, 0, 2, 0, 2, 0, 100, 1, 0, 92, 25000, 25000, 11, 201065, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - 0-92% ever 25 - cast"),
(99354, 0, 3, 0, 2, 0, 100, 1, 0, 90, 25000, 25000, 11, 201079, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - 0-90% ever 25 - cast"),

(101991, 0, 0, 0, 0, 0, 100, 0, 16000, 24000, 16000, 24000, 11, 204243, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 16-24"),
(101991, 0, 1, 0, 6, 0, 100, 1, 0, 0, 0, 0, 11, 204852, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - on death - cast"),

(99363, 0, 0, 0, 60, 0, 100, 1, 1, 1, 13000, 14000, 38, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "DH - on summon - combat"),

(101857, 0, 0, 0, 0, 0, 100, 0, 13000, 14000, 13000, 14000, 11, 201180, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 13-14 - cast"),

(99365, 0, 0, 0, 0, 0, 100, 0, 10000, 12000, 10000, 12000, 11, 201517, 0, 0, 0, 0, 0, 17, 8, 40, 0, 0, 0, 0, 0, "DH - ever 10-12 - cast"),

(99366, 0, 0, 0, 0, 0, 100, 0, 10000, 12000, 10000, 12000, 11, 201839, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - on 75-80 - cast"),
(99366, 0, 1, 0, 0, 0, 100, 0, 0, 70, 4000, 6000, 11, 201837, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - on 45 and ever 4-6 - cast"),

(100526, 0, 0, 0, 0, 0, 100, 0, 17000, 18000, 17000, 18000, 11, 201361, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 17-18 - cast"),


(100527, 0, 0, 0, 0, 0, 100, 0, 9000, 10000, 9000, 10000, 11, 201411, 4, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 10-12 - cast"),
(100527, 0, 1, 0, 2, 0, 100, 1, 49, 51, 9000, 10000, 11, 201399, 0, 0, 0, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0, "DH - ever 10-12 - cast"),



(95769, 0, 0, 0, 0, 0, 100, 0, 13000, 14000, 13000, 14000, 11, 200630, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 13-14 - cast"),

(95779, 0, 0, 0, 2, 0, 100, 1, 60, 65, 13000, 14000, 11, 200580, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - on 60-65 - cast"),
(95779, 0, 1, 0, 2, 0, 100, 0, 15, 95, 17000, 19000, 11, 200589, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - on 15-95 - cast"),

(99360, 0, 0, 0, 0, 0, 100, 0, 21000, 22000, 21000, 22000, 11, 201123, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 21 - cast"),

(99356, 0, 0, 0, 0, 0, 100, 0, 1, 2000, 12000, 13000, 11, 200764, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 12 - cast"),

(95772, 0, 0, 0, 0, 0, 100, 0, 19000, 20000, 19000, 20000, 11, 200618, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, "DH - evet 20 - on random cast"),

(101679, 0, 0, 0, 0, 0, 100, 1, 1, 1, 10, 10, 11, 200666, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "DH - pull - cast"),
(101679, 0, 1, 0, 2, 0, 100, 0, 0, 92, 17000, 19000, 11, 200684, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "DH - ever 17-19 - cast"),
(101679, 0, 2, 0, 1, 0, 100, 1, 1, 1, 10, 10, 28, 200666, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "DH - evade - unaura");

INSERT ignore INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES ('200684', 'spell_nightmare_toxin');


delete from areatrigger_actions where entry in (5669, 5696);
insert into `areatrigger_actions` (`entry`, `id`, `moment`, `actionType`, `targetFlags`, `spellId`, `maxCharges`, `aura`, `hasspell`, `chargeRecoveryTime`, `scale`, `hitMaxCount`, `amount`, `comment`) values
('5669','0','1','0','4096','200766','0','0','0','0','0','0','0','Vile Pollination'),
('5669','1','42','1','4096','200766','0','0','0','0','0','0','0','Vile Pollination'),

('5696','0','1','0','1','201076','0','0','0','0','0','0','0','Desecrated Ground'),
('5696','1','42','1','1','201076','0','0','0','0','0','0','0','Desecrated Ground');

delete from spell_linked_spell where spell_trigger in (201180, 201181, 201182);
INSERT INTO `spell_linked_spell` (`spell_trigger`, `spell_effect`, `type`, `caster`, `target`, `hastype`, `hastalent`, `hastype2`, `hastalent2`, `chance`, `cooldown`, `duration`, `hitmask`, `removeMask`, `targetCountType`, `targetCount`, `actiontype`, `group`, `comment`) VALUES 
('201180', '201181', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', 'Rampant life'),
('201181', '201182', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', 'Rampant life'),
('201182', '201183', '1', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '-1', '0', '0', 'Rampant life');

delete from creature_text where entry in (103344);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `comment`) VALUES
(103344, 0, 0, 'Моя кора – ваша погибель.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 1, 0, 'Горите!', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 1, 1, 'Вы станете поленьями в моем костре!', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 1, 2, 'Готовьтесь пойти на дрова!', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 2, 0, 'Я переломаю вас, как хворост.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to Player'),
(103344, 2, 1, 'Мои ветви отрастут вновь, а ваши руки и ноги – нет.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to Player'),
(103344, 2, 2, 'Я вырву вас с корнем.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 2, 3, 'Сейчас я вырву корень всех проблем.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 3, 0, 'Вам здесь не укорениться.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 4, 0, 'Дайте-ка я вас обниму. Крепко-крепко.', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to 0'),
(103344, 5, 0, 'Я же просил... оставить меня в покое...', 14, 0, 100, 0, 0, 0, 0, 'Дубосерд to Player');
