delete from creature WHERE id in (98426, 98435);
update creature_template set ScriptName = 'npc_unstable_amalgamation' where entry in (98426, 98425);

update creature_template set AIName = 'SmartAI' where entry in (98425, 98426, 98728, 98732, 98733, 105952, 103130, 105651, 106757, 106059, 102351, 105876, 98759, 98770);

delete from smart_scripts where entryorguid in (98425, 98426, 98728, 98732, 98733, 105952, 103130, 105651, 106757, 106059, 102351, 105876, 98759, 98770);
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
(98426, 0, 1, 0, 0, 0, 100, 0, 30000, 32000, 30000, 32000, 11,  193942, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 30 - cast"),
(98426, 0, 2, 3, 6, 0, 100, 1, 0, 0, 0, 0, 12, 98435, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),
(98426, 0, 3, 4, 61, 0, 100, 1, 0, 0, 0, 0, 12, 98435, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),
(98426, 0, 4, 5, 61, 0, 100, 1, 0, 0, 0, 0, 12, 98435, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),
(98426, 0, 5, 6, 61, 0, 100, 1, 0, 0, 0, 0, 12, 98435, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),

(98728, 0, 0, 0, 60, 0, 100, 0, 16000, 18000, 16000, 18000, 11, 202218, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - ever 17 - cast"),
(98728, 0, 1, 0, 0, 0, 100, 0, 15000, 18000, 15000, 18000, 11, 202223, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - ever 16- cast"),

(98732, 0, 0, 0, 1, 0, 100, 0, 6000, 8000, 5000, 8000, 11, 202490, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - ever 7- cast"),
(98732, 0, 1, 0, 0, 0, 100, 0, 6000, 8000, 5000, 10000, 11, 203592, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 8- cast"),

(98733, 0, 0, 0, 0, 0, 100, 0, 18000, 19000, 18000, 19000, 11, 210645, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 18- cast"),

(106757, 0, 0, 0, 0, 0, 100, 1, 180, 190, 18000, 19000, 11, 211778, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - on pull - cast"),

(105651, 0, 0, 0, 0, 0, 100, 0, 18000, 19000, 18000, 19000, 11, 211771, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 18- cast"),
(105651, 0, 1, 0, 0, 0, 100, 0, 7000, 9000, 8000, 9000, 11, 211774, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 8- cast"),

(102351, 0, 0, 0, 0, 0, 100, 0, 2000, 3000, 2000, 3000, 11, 211478, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 2 - cast"),

(98759, 0, 0, 0, 0, 0, 100, 0, 29000, 31000, 29000, 31000, 11, 211543, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 30 - cast"),

(98770, 0, 0, 0, 0, 0, 100, 0, 15000, 16000, 15000, 16000, 11, 211744, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 15 - cast"),
(98770, 0, 1, 0, 0, 0, 100, 0, 5000, 6000, 5000, 6000, 11, 211754, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 5 - cast"),
















(105876, 0, 0, 0, 6, 0, 100, 1, 0, 0, 0, 0, 11, 211501, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - cast"),

(106059, 0, 0, 0, 0, 0, 100, 0, 7000, 9000, 8000, 9000, 11, 211115, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 8- cast"),
(106059, 0, 1, 0, 0, 0, 100, 0, 5000, 7000, 5000, 7000, 11, 211125, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 8- cast"),

(103130, 0, 0, 0, 0, 0, 100, 1, 1, 19, 180, 1900, 11, 203952, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - on pull- cast"),
(103130, 0, 1, 0, 0, 0, 100, 0, 20000, 22000, 20000, 22000, 11, 203957, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 21 - cast"),

(105952, 0, 0, 0, 1, 0, 100, 0, 6000, 8000, 6000, 8000, 11, 210069, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - ever 7- cast"),
(105952, 0, 1, 0, 0, 0, 100, 0, 25000, 28000, 25000, 28000, 11, 210684, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 26- cast"),
(105952, 0, 2, 0, 0, 0, 100, 0, 19000, 22000, 19000, 22000, 11, 210688, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 20- cast"),

(98425, 0, 0, 0, 0, 0, 100, 0, 14000, 16000, 14000, 16000, 11, 193938, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 15 - cast"),
(98425, 0, 1, 0, 0, 0, 100, 0, 30000, 32000, 30000, 32000, 11,  193942, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "AW - ever 30 - cast"),
(98425, 0, 2, 3, 6, 0, 100, 1, 0, 0, 0, 0, 12, 98426, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),
(98425, 0, 3, 4, 61, 0, 100, 1, 0, 0, 0, 0, 12, 98426, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),
(98425, 0, 4, 5, 61, 0, 100, 1, 0, 0, 0, 0, 12, 98426, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum"),
(98425, 0, 5, 6, 61, 0, 100, 1, 0, 0, 0, 0, 12, 98426, 6, 3000, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "AW - on dead - sum");

replace INTO `spell_dummy_trigger` (`spell_id`, `spell_trigger`, `option`, `target`, `caster`, `targetaura`, `bp0`, `bp1`, `bp2`, `effectmask`, `aura`, `chance`, `comment`) VALUES 
('202218', '202175', '4', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'Поглощение'),
('211774', '211775', '5', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'Eye of the Beast'),

('211478', '211476', '5', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'Nether Spike'),
('211476', '203593', '4', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'Nether Spike'),
('211776', '211777', '4', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'Optic Blast');

replace into `spell_aura_trigger` (`spell_id`, `spell_trigger`, `option`, `target`, `caster`, `targetaura`, `bp0`, `bp1`, `bp2`, `effectmask`, `aura`, `chance`, `slot`, `comment`) VALUES 
('203952', '203954', '4', '0', '0', '0', '0', '0', '0', '7', '0', '0', '0', 'Пробой'),
('211778', '211776', '4', '0', '0', '0', '0', '0', '0', '7', '0', '0', '0', 'Optic Blast');


UPDATE `creature_template` SET `unit_flags`='32768' WHERE (`entry`='98759');

delete from areatrigger_actions where entry in (5053, 5821, 6818, 6915);
insert into `areatrigger_actions` (`entry`, `id`, `moment`, `actionType`, `targetFlags`, `spellId`, `maxCharges`, `aura`, `hasspell`, `chargeRecoveryTime`, `scale`, `hitMaxCount`, `amount`, `comment`) values
('5053','0','1','0','4096','194006','0','0','0','0','0','0','0','Лужа Слизи'),
('5053','1','50','1','4096','194006','0','0','0','0','0','0','0','Лужа Слизи'),

('6915','0','1','0','4096','211745','0','0','0','0','0','0','0','Fel Strike'),
('6915','1','50','1','4096','211745','0','0','0','0','0','0','0','Fel Strike'),

('6818','0','1','0','4096','210750','0','0','0','0','0','0','0','Collapsing Rift'),
('6818','1','50','1','4096','210750','0','0','0','0','0','0','0','Collapsing Rift'),

('5821','0','1','0','4096','202232','0','0','0','0','0','0','0','Поглощение'),
('5821','1','50','1','4096','202232','0','0','0','0','0','0','0','Поглощение');

delete from creature_text where entry in (98203, 98206, 98208);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `comment`) VALUES 
('98203', '0', '0', 'Stay back! It\'s mine!', '14', '0', '100', '0', '0', '0', '101906', 'Иванир to Player'),
('98203', '1', '0', 'Thieves! The mana is MINE!', '14', '0', '100', '0', '0', '0', '101907', 'Иванир to Player'),
('98203', '2', '1', 'Go away!', '14', '0', '100', '0', '0', '0', '101910', 'Иванир to 0'),
('98203', '2', '0', 'Get away from my mana!', '14', '0', '100', '0', '0', '0', '101909', 'Иванир to 0'),
('98203', '3', '0', 'More... more...', '14', '0', '100', '0', '0', '0', '101914', 'Иванир to Player'),

('98206', '0', '0', 'Form up, maggots! Secure the breach until we receive orders from Gul\'dan!', '14', '0', '100', '0', '0', '0', '105710', 'Генерал Ксакал to Player'),
('98206', '1', '0', 'Good! Some entertainment! I was getting restless!', '14', '0', '100', '0', '0', '0', '105711', 'Генерал Ксакал to Player'),
('98206', '2', '0', 'All who rise against the Legion are doomed!', '14', '0', '100', '0', '0', '0', '105719', 'Генерал Ксакал to 0'),
('98206', '3', '0', 'Reinforcements to me! NOW!', '14', '0', '100', '0', '0', '0', '105717', 'Генерал Ксакал to 0'),
('98206', '4', '0', '|TInterface\\Icons\\Spell_Nature_Earthquake:20|tGeneral Xakal begins to cast |cFFF00000|Hspell:197810|h[Shatter]|h|r!', '41', '0', '100', '0', '0', '0', '103571', 'Генерал Ксакал to 0'),
('98206', '5', '0', 'All in my shadow will crumble and fall!', '14', '0', '100', '0', '0', '0', '105718', 'Генерал Ксакал to 0'),
('98206', '6', '0', 'No... NO! None can best... the great Xakal...', '14', '0', '100', '0', '0', '0', '105713', 'Генерал Ксакал to Player'),


('98208', '0', '0', 'My, my... Someone has made quite a mess down here. It has been too long since we purged these catacombs of refuse. It appears we have a rat infestation.', '14', '0', '100', '0', '0', '0', '105698', 'Советник Вандрос to 0'),
('98208', '1', '0', 'Find the vermin and bring me their heads! Leave no stone unturned!', '14', '0', '100', '0', '0', '0', '105699', 'Советник Вандрос to 0'),
('98208', '2', '0', 'I have not survived for ten thousand years just to fall to a swarm of rats.', '14', '0', '100', '0', '0', '0', '105700', 'Советник Вандрос to Player'),
('98208', '3', '0', 'Have you vermin ever witnessed such raw power? I think not.', '14', '0', '100', '0', '0', '0', '105707', 'Советник Вандрос to 0'),
('98208', '4', '0', 'I am a conduit of the Nightwell\s glorious power! I am NIGHTBORNE!', '14', '0', '100', '0', '0', '0', '105708', 'Советник Вандрос to 0'),
('98208', '5', '0', '|TInterface\\Icons\\Spell_Holy_BorrowedTime:20|tRe-engage Advisor Vandros before you are |cFFF00000|Hspell:203935|h[Lost In Time]|h|r!', '41', '0', '100', '0', '0', '0', '105697', 'Советник Вандрос to 0'),
('98208', '6', '0', 'Enough! You little beasts are getting out of hand!', '14', '0', '100', '0', '0', '0', '105706', 'Советник Вандрос to Player'),
('98208', '7', '0', 'Think of this as a mercy killing.', '14', '0', '100', '0', '0', '0', '105705', 'Советник Вандрос to Player'),
('98208', '8', '0', 'Alas... blind courage only triumphs in the fairy tales.', '14', '0', '100', '0', '0', '0', '105702', 'Советник Вандрос to 0'),
('98208', '9', '0', 'The Grand Magistrix... will have your heads for this...', '14', '0', '100', '0', '0', '0', '105701', 'Советник Вандрос to Player');


