update creature_template set AIName = 'SmartAI' where entry in (96247, 98406, 91006, 91001, 101438, 91000, 91008, 90997, 90998, 101437, 92538, 91002, 102404,     102253, 102232, 102287, 102295);

delete from smart_scripts where entryorguid in (96247, 98406, 91006, 91001, 91000, 101438, 91008, 90997, 90998, 101437, 102404, 92538, 91002, 102253, 102287, 102232, 102295);
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
(96247, 0, 0, 0, 2, 0, 100, 1, 0, 2, 0, 0, 11, 183401, 6, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - on dead - cast"),

(91006, 0, 0, 0, 0, 0, 100, 0, 17000, 18000, 17000, 18000, 11,  193639, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 18 - cast"),
(91006, 0, 1, 0, 0, 0, 100, 0, 17000, 18000, 17000, 18000, 11,  202181, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 21 - cast"),

(91000, 0, 0, 0, 0, 0, 100, 0, 15000, 16000, 15000, 16000, 11, 193505, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 16 - cast"),
(91000, 0, 1, 0, 0, 0, 100, 0, 15000, 16000, 15000, 16000, 11, 193511, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 16 - cast"),
(91000, 0, 2, 0, 0, 0, 100, 1, 17000, 17000, 15000, 16000, 11, 209347, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - ever 16 - cast conversation"),

(91008, 0, 0, 0, 0, 0, 100, 0, 2000, 3000, 2000, 3000, 11, 183633, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 2-3 - cast"),

(102404, 0, 0, 0, 0, 0, 100, 0, 7000, 8000, 7000, 8000, 11, 202230, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 7-8 - cast"),
(102404, 0, 1, 0, 0, 0, 100, 0, 30000, 31000, 30000, 31000, 11, 183548, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - ever 31 - cast"),

(92538, 0, 0, 0, 60, 0, 100, 0, 1000, 1000, 1000, 1000, 11, 193803, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - on pull - cast"),

(91002, 0, 0, 0, 0, 0, 100, 1, 1000, 1000, 1000, 1000, 11, 183560, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - on pull - cast"),
(91002, 0, 1, 0, 0, 0, 100, 0, 6000, 7000, 6000, 7000, 11, 183539, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, "NL - ever 7 - cast"),

(102253, 0, 0, 0, 2, 0, 100, 1, 67, 70, 6000, 7000, 11, 188587, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - on 67-70%- cast"),

(102232, 0, 0, 0, 0, 0, 100, 0, 2000, 3000, 2000, 3000, 11, 183633, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 2-3 - cast"),
(102232, 0, 1, 0, 0, 0, 100, 0, 27000, 30000, 27000, 30000, 11, 193585, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 2-3 - cast"),


(102287, 0, 0, 0, 0, 0, 100, 0, 21000, 22000, 21000, 22000, 11, 201983, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 21-22 - cast"),

(102295, 0, 0, 0, 0, 0, 100, 0, 30000, 45000, 30000, 45000, 1, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 30-45 - text"),
(102295, 0, 1, 0, 0, 0, 100, 0, 3000, 4500, 3000, 4500, 11, 201959, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, "NL - ever 3-4,5 - cast"),


(90998, 0, 0, 0, 0, 0, 100, 0, 2000, 3000, 2000, 3000, 11, 186269, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 2-3 - cast"),
(90998, 0, 1, 0, 0, 0, 100, 0, 46000, 47000, 46000, 47000, 11, 202108, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 46 - cast"),  -- 94224 -> 186533

(90997, 0, 0, 0, 0, 0, 100, 0, 16000, 17000, 16000, 17000, 11, 183088, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 16-17 - cast"),  --  183095 2 рандома

(101437, 0, 0, 0, 0, 0, 100, 0, 10000, 11000, 10000, 11000, 11, 202075, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 10-11 - cast"), 

(101438, 0, 0, 0, 1, 0, 100, 0, 2000, 3000, 2000, 3000, 11, 101438, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - ever 2-3 - cast"),

(91001, 0, 0, 0, 1, 0, 100, 0, 4000, 6000, 4000, 6000, 11,  209513, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - ever 4-6 - cast"),
(91001, 0, 1, 0, 0, 0, 100, 0, 24000, 26000, 24000, 26000, 11, 183433, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 24-26 - cast"),
(91001, 0, 2, 0, 0, 0, 100, 0, 34000, 34000, 24000, 26000, 11, 183504, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "NL - ever 24-26 - cast"),
(91001, 0, 3, 0, 0, 0, 100, 0, 35000, 36000, 24000, 26000, 11, 183465, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 24-26 - cast"),

(98406, 0, 0, 0, 0, 0, 100, 0, 16000, 17000, 16000, 1700, 11, 193941, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "NL - ever 17 - cast");


delete from areatrigger_actions where entry in (4083, 4355, 4100);
insert into `areatrigger_actions` (`entry`, `id`, `moment`, `actionType`, `targetFlags`, `spellId`, `maxCharges`, `aura`, `hasspell`, `chargeRecoveryTime`, `scale`, `hitMaxCount`, `amount`, `comment`) values
('4083','0','1','0','4096','183407','0','0','0','0','0','0','0','Кислотный всплеск'),
('4083','1','50','1','4096','183407','0','0','0','0','0','0','0','Кислотный всплеск'),

('4100','0','1','0','4096','183566','0','0','0','0','0','0','0','Rancid Pool'),
('4100','1','50','1','4096','183566','0','0','0','0','0','0','0','Rancid Pool'),

('4355','0','1','0','4096','186576','0','0','0','0','0','0','0','Petrifying Cloud'),
('4355','1','4','2','4096','186576','0','0','0','1000','0','0','0','Petrifying Cloud'),
('4355','2','50','1','4096','186576','0','0','0','0','0','0','0','Petrifying Cloud');

delete from spell_dummy_trigger where spell_id in (202084, 183539, 183538, 183548);
replace INTO `spell_dummy_trigger` (`spell_id`, `spell_trigger`, `option`, `target`, `caster`, `targetaura`, `bp0`, `bp1`, `bp2`, `effectmask`, `aura`, `chance`, `comment`) VALUES 
('202084', '202086', '4', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'ожог'),

('201959', '201953', '5', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'кристальный шип'),

('183539', '183538', '4', '1', '1', '0', '0', '0', '0', '1', '0', '0', 'Шипастый язык'),

('183548', '183554', '5', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'призыв червя');  -- чек, чек, чек

replace INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES 
('183433', 'spell_submerge'),
('183088', 'spell_avalanche');

UPDATE `creature` SET `spawndist`='0' WHERE (`guid`='1155197');
UPDATE `creature` SET `spawndist`='0' WHERE (`guid`='1155247');
UPDATE `creature` SET `spawndist`='0' WHERE (`id`='100701');
UPDATE `creature` SET `spawndist`='0' WHERE (`id`='100700');
UPDATE `creature` SET `id`='105738' WHERE (`guid`='1155254');
UPDATE `creature` SET `id`='105738' WHERE (`guid`='1155249');
UPDATE `creature` SET `position_x`='2816.66', `position_y`='1353.97', `position_z`='4.41' WHERE (`guid`='1155247');
UPDATE `creature_template` SET `unit_flags`='0' WHERE (`entry`='98406');
UPDATE `creature_template` SET `faction`='16' WHERE (`entry`='101445');
update creature_template set ScriptName = 'npc_stonedark_slave' where entry in (102228);
update creature_template set ScriptName = 'npc_emberhusk_dominator' where entry in (102295);
UPDATE `creature_template` SET `spell1`='186533' WHERE (`entry`='94224');
UPDATE `creature_template` SET `unit_flags`='32772' WHERE (`entry`='91002');
UPDATE `creature_template_wdb` SET `Name1`='Emberhusk Scorpion', `DisplayId1`='43143' WHERE (`Entry`='102287');

delete from creature where guid in (1155167);
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `phaseMask`, `PhaseId`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `npcflag2`, `unit_flags`, `dynamicflags`, `AiID`, `MovementID`, `MeleeID`, `isActive`) VALUES 
('1155167', '98406', '1458', '7546', '7546', '262', '1', '', '0', '0', '2948.37', '1217.93', '101.896', '2.48148', '7200', '0', '0', '0', '0', '1', '0', '0', '536870912', '0', '0', '0', '0', '0');

delete from creature_text where entry in (91003, 91004, 91005, 91007);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `comment`) VALUES 
('91003', '0', '0', 'Rok SMASH!', '14', '0', '100', '0', '0', '0', '102714', 'Рокмора to 0'),
('91003', '1', '0', 'Rokmora rears back for |cFFFF0000|Hspell:188169|h[Razor Shards]|h|r!', '41', '0', '100', '0', '0', '0', '108748', 'Рокмора to Razor Shards Stalker'),
('91003', '2', '0', 'Rok... no... break', '14', '0', '100', '0', '0', '0', '102713', 'Рокмора to Player'),


('91004', '0', '0', 'Pay attention, Navarogg. I want you to see your heroes die.', '14', '0', '100', '0', '0', '0', '103031', 'Уларогг Скаломол to 0'),
('91004', '1', '0', 'Ularogg enters the |cFFFF0000|Hspell:198510|h[Stance of the Mountain]|h|r!', '41', '0', '100', '0', '0', '0', '108725', 'Уларогг Скаломол to 0'),
('91004', '3', '0', 'So this is what it feels like to break.', '14', '0', '100', '0', '0', '0', '103028', 'Уларогг Скаломол to Player'),

('91005', '0', '0', 'Дрогбары спрыгивают вниз!', '41', '0', '100', '0', '0', '0', '104463', 'Нараксас to 0'),
('91005', '1', '0', '|TInterface\\Icons\\inv_fishing_lure_worm.blp:20|t%s targets $n for |cFFFF0404|Hspell:199176|h[Spiked Tongue]|h|r!', '42', '0', '100', '0', '0', '0', '106322', 'Нараксас to Player'),

('91007', '0', '0', 'Yes. TRY to take the hammer from me!', '14', '0', '100', '0', '0', '0', '103071', 'Даргрул to 0'),
('91007', '1', '0', '|TInterface\\Icons\\spell_shaman_lavaflow.blp:20|t %s readies |cFFF00000|Hspell:200404|h[Magma Wave]|h|r. Hide!', '41', '0', '100', '0', '0', '0', '108842', 'Даргрул to 0'),
('91007', '2', '0', 'How is this possible?! I... I was chosen...', '14', '0', '100', '0', '0', '0', '103068', 'Даргрул to Player');




delete from waypoint_data where id in (9100400);
INSERT INTO `waypoint_data` (`id`, `point`, `position_x`, `position_y`, `position_z`, `orientation`, `delay`, `move_flag`, `speed`, `action`, `action_chance`, `entry`, `wpguid`) VALUES 
(9100400, 1, 2820.56, 1325.45, -4.54633, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 2, 2802.25, 1316.7, -4.29819, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 3, 2795.72, 1301.3, -4.29819, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 4, 2778.16, 1288.85, -4.32394, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 5, 2768.9, 1267.93, -4.29753, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 6, 2744.28, 1259.7, -4.78079, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 7, 2735.45, 1246.16, -4.78259, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 8, 2717.75, 1251.4, -4.78259, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 9, 2695.62, 1251.58, -4.78259, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 10, 2677.29, 1259.6, -4.78155, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 11, 2660.6, 1268.23, -4.78155, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 12, 2655.97, 1281.47, -4.78209, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 13, 2642.57, 1294.07, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 14, 2635.1, 1313.17, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 15, 2625.24, 1329.53, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 16, 2622.05, 1348.13, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 17, 2614.58, 1355.12, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 18, 2605.5, 1377.67, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 19, 2595.58, 1381.25, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 20, 2575.87, 1396.24, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 21, 2556.38, 1397.96, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 22, 2545.27, 1408.56, -4.78263, 0, 0, 1, 25, 0, 100, 0, 0),
(9100400, 23, 2549.71, 1449.33, -51, 0, 0, 1, 25, 335, 100, 0, 0);
