-- вход коверсатион 202036
update creature_template set AIName = 'SmartAI' where entry in (95842, 97087, 97068, 100956, 95834, 96640, 96574, 95832, 101639 , 99891, 96677, 96611, 96608);

update creature_template set unit_flags = '33600' where entry in (97795, 101758);
UPDATE `creature_template` SET `unit_flags`='32848' WHERE entry in (97202, 97219);

UPDATE `creature_template` SET `ScriptName`='npc_trigger_hov_conversation' WHERE (`entry`='101712');

delete from smart_scripts where entryorguid in (95842, 97087, 97068, 100956, 95834, 96640, 96574, 95832, 101639, 99891, 96677, 96611, 96608);
INSERT INTO `smart_scripts` (`entryorguid`, `source_type`, `id`, `link`, `event_type`, `event_phase_mask`, `event_chance`, `event_flags`, `event_param1`, `event_param2`, `event_param3`, `event_param4`, `action_type`, `action_param1`, `action_param2`, `action_param3`, `action_param4`, `action_param5`, `action_param6`, `target_type`, `target_param1`, `target_param2`, `target_param3`, `target_x`, `target_y`, `target_z`, `target_o`, `comment`) VALUES
(95842, 0, 0, 0, 0, 0, 100, 0, 3000, 5000, 3000, 5000, 11, 198595, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 4 - cast"),
(95842, 0, 1, 0, 0, 0, 100, 0, 17000, 20000, 17000, 20000, 11, 198599, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 18 - cast"),

(95834, 0, 0, 0, 0, 0, 100, 0, 31000, 31000, 31000, 31000, 11, 198934, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 31 - cast"),
(95834, 0, 1, 0, 0, 0, 100, 0, 16000, 17000, 16000, 17000, 11, 198931, 0, 0, 0, 0, 0, 28, 40, 0, 0, 0, 0, 0, 0, "HoV - ever 16 - cast"),


(95832, 0, 0, 0, 0, 0, 100, 0, 16000, 17000, 16000, 17000, 11, 198944, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 16 - cast"),
(95832, 0, 1, 0, 0, 0, 100, 0, 12000, 14000, 12000, 14000, 11, 199050, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 13 - cast"),

(101639, 0, 0, 0, 0, 0, 100, 0, 13000, 15000, 13000, 15000, 11, 198944, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 13 - cast"),
(101639, 0, 1, 0, 0, 0, 100, 0, 10000, 12000, 10000, 12000, 11, 199050, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 11 - cast"),

(96677, 0, 0, 0, 0, 0, 100, 0, 4000, 6000, 4000, 6000, 11, 185425, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 5 - cast"),
(96677, 0, 1, 0, 0, 0, 100, 0, 10000, 12000, 10000, 12000, 11, 196194, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 11 - cast"),

(96608, 0, 0, 0, 0, 0, 100, 1, 10, 120, 10000, 12000, 11, 199184, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "HoV - on pull - cast"),

(96611, 0, 0, 0, 0, 0, 100, 0, 21000, 22000, 21000, 22000, 11, 199090, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 21 - cast"),
(96611, 0, 1, 0, 0, 0, 100, 0, 24000, 25000, 21000, 22000, 11, 199151, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 21 - cast"),
(96611, 0, 2, 0, 2, 0, 100, 1, 0, 40, 0, 0, 11, 190225, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "HoV - on 40% - cast"),


(96574, 0, 0, 0, 2, 0, 100, 1, 0, 30, 0, 0, 11, 198745, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "HoV - on 30% - cast"),
(96574, 0, 1, 0, 0, 0, 100, 0, 5000, 10000, 5000, 10000, 11, 199805, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 5-10 - cast"),

(96640, 0, 0, 0, 0, 0, 100, 0, 2000, 3000, 2000, 3000, 11, 191401, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 2-3 - cast"),
(96640, 0, 1, 0, 0, 0, 100, 0, 27000, 30000, 27000, 30000, 11, 199247, 1, 0, 0, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 27 - cast"),
(96640, 0, 2, 0, 0, 0, 100, 0, 16000, 20000, 16000, 20000, 11, 199210, 1, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 16 - cast"),

(97068, 0, 0, 0, 0, 0, 100, 0, 15000, 17000, 15000, 17000, 11, 198888, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 16 - cast"),
(97068, 0, 1, 0, 0, 0, 100, 0, 17000, 23000, 17000, 23000, 11, 198892, 0, 0, 0, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 17-23 - cast"),

(99891, 0, 0, 0, 0, 0, 100, 0, 15000, 17000, 15000, 17000, 11, 198888, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 16 - cast"),
(99891, 0, 1, 0, 0, 0, 100, 0, 17000, 23000, 17000, 23000, 11, 198892, 0, 0, 0, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 17-23 - cast"),

(100956, 0, 0, 0, 60, 0, 100, 1, 100, 170, 150, 170, 11, 198895, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "HoV - on spawn - cast"),
(100956, 0, 1, 0, 60, 0, 100, 0, 1000, 1700, 1500, 1700, 89, 7, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, "HoV - on spawn - random move"),

(97087, 0, 0, 0, 0, 0, 100, 0, 8000, 12000, 7000, 12000, 11, 199772, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, "HoV - ever 9 - cast");

replace INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES 
('198599', 'spell_thunderstrike');

UPDATE `creature_template_addon` SET `auras`='' WHERE (`entry`='96677');
-- 202153 конверсатион в угодьях

replace INTO `spell_dummy_trigger` (`spell_id`, `spell_trigger`, `option`, `target`, `caster`, `targetaura`, `bp0`, `bp1`, `bp2`, `effectmask`, `aura`, `chance`, `comment`) VALUES 
('199805', '0', '4', '0', '0', '0', '0', '0', '0', '1', '0', '0', 'Crakle');


 -- 199747 хил
replace INTO `areatrigger_scripts` (`entry`, `ScriptName`) VALUES 
('4885', 'at_sanctify');

delete from spell_target_filter where spellId in (199620, 199621, 199622, 199614);
INSERT INTO `spell_target_filter` (`spellId`, `targetId`, `option`, `param1`, `param2`, `param3`, `aura`, `chance`, `effectMask`, `resizeType`, `count`, `maxcount`, `addcount`, `addcaster`, `comments`) VALUES 
('199620', '7', '14', '97083', '97081', '97084', '0', '0', '7', '2', '3', '0', '0', '0', 'HoV: Узы королей'),
('199621', '7', '14', '97083', '95843', '97084', '0', '0', '7', '2', '3', '0', '0', '0', 'HoV: Узы королей'),
('199622', '7', '14', '97081', '95843', '97084', '0', '0', '7', '2', '3', '0', '0', '0', 'HoV: Узы королей'),
('199614', '7', '14', '97081', '95843', '97083', '0', '0', '7', '2', '3', '0', '0', '0', 'HoV: Узы королей');


delete from areatrigger_actions where entry in (5485, 5488, 5578);
insert into `areatrigger_actions` (`entry`, `id`, `moment`, `actionType`, `targetFlags`, `spellId`, `maxCharges`, `aura`, `hasspell`, `chargeRecoveryTime`, `scale`, `hitMaxCount`, `amount`, `comment`) values
('5485','0','1','0','4096','198903','0','0','0','0','0','0','0','Crackling Storm'),
('5485','1','42','1','4096','198903','0','0','0','0','0','0','0','Crackling Storm'),

('5578','0','1','0','4096','199818','0','0','0','0','0','0','0','Разряд'),
('5578','1','42','1','4096','199818','0','0','0','0','0','0','0','Разряд'),

('5488','0','1','0','1','198936','0','0','0','0','0','0','0','Rune of Healing'),
('5488','1','42','1','1','198936','0','0','0','0','0','0','0','Rune of Healing');

delete from creature_text where entry in (94960, 95833, 95674, 99868, 95676, 95675);
INSERT INTO `creature_text` (`Entry`, `GroupID`, `ID`, `Text`, `Type`, `Language`, `Probability`, `Emote`, `Duration`, `Sound`, `BroadcastTextID`, `comment`) VALUES 
('94960', '0', '0', 'Я стану вашим судьей.', '14', '0', '100', '0', '0', '0', '102956', 'Химдалль to 0'),
('94960', '1', '0', 'Драконы, придите мне на помощь!', '14', '0', '100', '0', '0', '0', '0', 'Химдалль to 0'),
('94960', '1', '1', 'Врата не должны пасть!', '14', '0', '100', '0', '0', '0', '102947', 'Химдалль to 0'),
('94960', '1', '2', 'Штормовые драконы! Ко мне!', '14', '0', '100', '0', '0', '0', '102945', 'Химдалль to 0'),
('94960', '1', '3', 'Драконы! Сюда!', '14', '0', '100', '0', '0', '0', '102944', 'Химдалль to 0'),
('94960', '2', '0', '|TInterface\\Icons\\INV_Misc_Horn_03:20|t Химдалль трубит в |cFFFF0404|Hspell:191284|h[Рог Доблести]|h|r, призывая штормовых драконов!', '41', '0', '100', '0', '0', '0', '104163', 'Химдалль to 0'),
('94960', '3', '0', 'Кровь недостойных омоет эти чертоги!', '14', '0', '100', '0', '0', '0', '102943', 'Химдалль to 0'),
('94960', '3', '1', 'Достойны вы или нет – я пролью вашу кровь!', '14', '0', '100', '0', '0', '0', '102941', 'Химдалль to 0'),
('94960', '4', '0', 'Я... недостоин...', '14', '0', '100', '0', '0', '0', '102950', 'Химдалль to Player'),

('95833', '0', '0', 'Эйир, я не подведу тебя!', '14', '0', '100', '0', '0', '0', '102993', 'Хирья to 0'),
('95833', '1', '0', 'Я изгоню вас из священных чертогов!', '14', '0', '100', '0', '0', '0', '102985', 'Хирья to 0'),

('95833', '1', '1', 'Никто не смеет осквернять эти чертоги!', '14', '0', '100', '0', '0', '0', '102986', 'Хирья to 0'),

('95833', '2', '0', 'Эйир... Ты напрасно поверила в меня...', '14', '0', '100', '0', '0', '0', '102988', 'Хирья to 106848'),
('95833', '2', '2', 'I am sorry, Eyir... I have failed you...', '14', '0', '100', '0', '0', '54682', '102987', 'Хирья to Player'),

('95674', '0', '0', '|TInterface\\Icons\\spell_hunter_lonewolf:20|t Фенрир издает |cFFFF0404|Hspell:196543|h[пугающий вой]|h|r!', '41', '0', '100', '0', '0', '0', '104038', 'Фенрир to 0'),
('95674', '1', '0', 'Раненый Фенрир отступает в свое логово.', '41', '0', '100', '0', '0', '0', '104029', 'Фенрир to 0'),

('99868', '0', '0', '|TInterface\\Icons\\spell_hunter_lonewolf:20|t Фенрир издает |cFFFF0404|Hspell:196543|h[пугающий вой]|h|r!', '41', '0', '100', '0', '0', '0', '104038', 'Фенрир to 0'),
('99868', '1', '0', '|TInterface\\Icons\\ability_fixated_state_red:20|t Фенрир учуял |cFFFF0404|Hspell:196838|h[запах вашей крови]|h|r! Бегите!', '42', '0', '100', '0', '0', '0', '104505', 'Фенрир to Player'),


('95676', '0', '0', 'Испытания показали, что ваши сила, сноровка и мудрость достойны величайших королей врайкулов. Что ж... вам предстоит сойтись с ними в бою. Одержите победу – и получите награду!', '14', '0', '100', '0', '0', '0', '100271', 'Один to Player'),
('95676', '1', '0', 'Победителям – достойная награда... Эгида Агграмара ваша.', '14', '0', '100', '0', '0', '0', '100240', 'Один to Король Ранульф'),
('95676', '2', '0', 'Удивительно! Я не верил, что кто-то может сравниться с валарьярами... Но вы доказали, что это возможно.', '14', '0', '100', '0', '0', '0', '102879', 'Один to Один'),
('95676', '3', '0', 'Вашим последним испытанием... стану я. Победите – и я высеку ваши имена на стенах этих чертогов. И дарую вам достойную награду.', '14', '0', '100', '0', '0', '0', '102881', 'Один to Один'),
('95676', '4', '0', 'Веками я не встречал достойных противников. Да начнется битва!', '14', '0', '100', '0', '0', '0', '102913', 'Один to Player'),

('95676', '5', '0', 'Знайте, герои: я не стану себя сдерживать.', '14', '0', '100', '0', '0', '0', '102885', 'Один to 0'),
('95676', '6', '0', '|TInterface\\Icons\\ability_priest_flashoflight:20|t Один начинает произносить заклинание |cFFFF0404|Hspell:198077|h[\"Расколотые копья\"]|h|r!', '41', '0', '100', '0', '0', '0', '106485', 'Один to 0'),
('95676', '7', '0', 'У каждого есть слабое место. Я найду ваши!', '14', '0', '100', '0', '0', '0', '102893', 'Один to 0'),
('95676', '7', '1', 'Гибкий ум так же опасен, как и острый меч.', '14', '0', '100', '0', '0', '0', '102891', 'Один to 0'),
('95676', '8', '0', '|TINTERFACE\\ICONS\\trade_archaeology_vrykul_runestick:20|t Один помечает всех противников |cFFFF0404|Hspell:197961|h[руническим клеймом]|h|r!', '42', '0', '100', '0', '0', '0', '103781', 'Один to Player'),
('95676', '9', '0', 'Довольно! Победа за вами! Вы удивительные создания. И вас ждет достойная награда.', '12', '0', '100', '0', '0', '0', '102907', 'Один to 0'),


('95675', '0', '0', 'Отдайте Эгиду или умрите!', '14', '0', '100', '0', '0', '0', '102921', 'Король-Бог Сковальд to 0'),
('95675', '1', '0', 'Сгиньте в неугасимом пламени!', '14', '0', '100', '0', '0', '0', '102934', 'Король-Бог Сковальд to 0'),
('95675', '1', '1', 'Ваша смерть будет страшна!', '14', '0', '100', '0', '0', '0', '102937', 'Король-Бог Сковальд to 0'),
('95675', '1', '2', 'Ваши муки будут вечными!', '14', '0', '100', '0', '0', '0', '102936', 'Король-Бог Сковальд to 0'),
('95675', '2', '0', '|TInterface\\Icons\\Spell_Fire_FelFlameRing:20|t Сковальд начинает произносить заклинание |cFFFF0404|Hspell:193826|h[\"Рагнарек\"]|h|r!', '41', '0', '100', '0', '0', '0', '106469', 'Король-Бог Сковальд to 0'),
('95675', '3', '0', 'Сила Эгиды – моя!', '14', '0', '100', '0', '0', '0', '102930', 'Король-Бог Сковальд to Эгида Агграмара'),
('95675', '3', '1', 'Эгида обрела истинного хозяина!', '14', '0', '100', '0', '0', '0', '102928', 'Король-Бог Сковальд to Эгида Агграмара'),
('95675', '4', '0', 'Все мои планы... рухнули...', '14', '0', '100', '0', '0', '0', '102927', 'Король-Бог Сковальд to Player');




delete from creature where id = 95674;
delete from creature where guid in (1152810,1152808);
INSERT INTO `creature` (`guid`, `id`, `map`, `zoneId`, `areaId`, `spawnMask`, `phaseMask`, `PhaseId`, `modelid`, `equipment_id`, `position_x`, `position_y`, `position_z`, `orientation`, `spawntimesecs`, `spawndist`, `currentwaypoint`, `curhealth`, `curmana`, `MovementType`, `npcflag`, `npcflag2`, `unit_flags`, `dynamicflags`, `isActive`) VALUES 
(1152810, 95674, 1477, 7672, 7983, 262, 1, '', 0, 0, 3006.39, 2980.55, 618.48, 2.26, 86400, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(1152808, 95674, 1477, 7672, 7983, 262, 1, '', 0, 0, 3154.69, 3166.24, 593.6, 3.29, 86400, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
